In [ ]:
!pip install pandas

Requirement already satisfied: pandas in /usr/local/lib/python3.6/dist-packages (1.1.5)
Requirement already satisfied: numpy>=1.15.4 in /usr/local/lib/python3.6/dist-packages (from pandas) (1.19.5)
Requirement already satisfied: pytz>=2017.2 in /usr/local/lib/python3.6/dist-packages (from pandas) (2018.9)
Requirement already satisfied: python-dateutil>=2.7.3 in /usr/local/lib/python3.6/dist-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /usr/local/lib/python3.6/dist-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)

In [ ]:
import pandas as pd

# **Creating Series from Scratch**

***A Pandas Series is a one-dimensional array of indexed data. It can be created from a list or array as follows:***

In [ ]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

***As we see in the output, the Series wraps both a sequence of values and a sequence of indices, which we can access with the values and index attributes.***

In [ ]:
data.values

array([0.25, 0.5 , 0.75, 1.  ])

In [ ]:
data.index

RangeIndex(start=0, stop=4, step=1)

In [ ]:
data[1]

0.5

In [ ]:
data[1:3]

1    0.50
2    0.75
dtype: float64

# **Series as generalized NumPy array**

***While the NumPy Array has an implicitly defined integer index used to access the values, the Pandas Series has anexplicitly definedindex associated with the values.***

In [ ]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd' ])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [ ]:
data['b']

0.5

In [ ]:
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                  index=[2, 5, 3, 7])
data

2    0.25
5    0.50
3    0.75
7    1.00
dtype: float64

In [ ]:
data[5]

0.5

# **Series as specialized dictionary**

***A dictionary is a structure that maps arbitrary keys to a set of arbitrary values, and a Series is a structure which maps typed keys to a set of typed values.***

In [ ]:
population_dicts = {'California': 38332521,
                    'Texas': 26448193,
                    'New York': 19651127,
                    'Florida': 19552860,
                    'Illinois': 12882135}
population = pd.Series(population_dicts)
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [ ]:
population['California']

38332521

In [ ]:
population['California':'Illinois']

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

**Constructing Series objects**

*pd.Series(data, index=index)*

where **index** is an optional argument, and **data** can be one of many entities

For example, **data** can be a list or NumPy array, in which case **index** defaults to an integer sequence:

In [ ]:
pd.Series([2, 4, 6])

0    2
1    4
2    6
dtype: int64

**data** can be a scalar, which is repeated to fill the specified index:

In [ ]:
pd.Series(5, index=[100, 200, 300])

100    5
200    5
300    5
dtype: int64

**data** can be a dictionary

In [ ]:
pd.Series({2:'a', 1:'b', 3:'c'})

2    a
1    b
3    c
dtype: object

In each case, the index can be explicitly set if a different result is preferred:

In [ ]:
pd.Series({2:'a', 1:'b', 3:'c'}, index=[3, 2])

3    c
2    a
dtype: object

*Notice that in this case, the **Series** is populated only with the explicity identified keys*

# **DataFrame as generalized NumPy array**

***If a Series is an analog of a one-dimensional array with flexible indices, a DataFrame is an analog of a two-dimensional array with both flexible row indices and flexible column names.***

In [ ]:
area_dict = {'California': 423967, 'Texas': 695662, 'New York': 141297,
             'Florida': 170312, 'Illinois': 149995}
area = pd.Series(area_dict)
area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [ ]:
states = pd.DataFrame({'population': population,
                       'area': area})
states

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

In [ ]:
states.index

Index(['California', 'Texas', 'New York', 'Florida', 'Illinois'], dtype='object')

In [ ]:
states.columns

Index(['population', 'area'], dtype='object')

# **DataFrame as specialized dictionary**

***Where a dictionary maps a key to a value, a DataFrame maps a column name to a Series of column data.***

In [ ]:
states['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

**Potential point of confusion:** *in a two-dimensional NumPy array, data[0] will return the first row. For a DataFrame, data['col0'] will return the first column.*

**Constructing DataFrame objects**

*From a single Series object: a DataFrame is a collection of Series objects, and a single-column DataFrame can be constructed from a single Series.*

In [ ]:
pd.DataFrame(population, columns=['population'])

            population
California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135

*From a list of dicts: any list of dictionaries can be made into a DataFrame.*

In [ ]:
data = [{'a': i, 'b': 2 * i}
         for i in range(3)]
pd.DataFrame(data)

   a  b
0  0  0
1  1  2
2  2  4

*From a dictionary of Series objects: a DataFramecan be constructed from a dictionary of Series objects*

In [ ]:
pd.DataFrame({'population': population,
              'area': area})

            population    area
California    38332521  423967
Texas         26448193  695662
New York      19651127  141297
Florida       19552860  170312
Illinois      12882135  149995

*From a two-dimensional NumPy array: we can create a DataFrame with any specified column and index names. If omitted, an integer index will be used for each.*

In [ ]:
import numpy as np

In [ ]:
pd.DataFrame(np.random.rand(3, 2),
             columns=['foo', 'bar'],
             index=['a','b','c'])

        foo       bar
a  0.467138  0.864474
b  0.486997  0.711698
c  0.459141  0.840693

# **Data Selection in Series**

*A Series object acts in many ways like a one-dimensional NumPy array, and in many ways like a standard Python dictionary.*

***Series as dictionary***

In [ ]:
import pandas as pd
data = pd.Series([0.25, 0.5, 0.75, 1.0],
                 index=['a', 'b', 'c', 'd'])
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [ ]:
data['b']

0.5

*We can also use dictionary-like Python expressions and methods to examine the keys/indices and values:*

In [ ]:
'a' in data

True

In [ ]:
data.keys()

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
list(data.items())

[('a', 0.25), ('b', 0.5), ('c', 0.75), ('d', 1.0)]

*You can extend a Series by assigning to a new index value:*

In [ ]:
data['e'] = 1.25
data

a    0.25
b    0.50
c    0.75
d    1.00
e    1.25
dtype: float64

***Series as one-dimensional array***

*When slicing with an explicit index (i.e.,data['a':'c']), the final index is included in the slice.*

In [ ]:
# slicing by explicit index
data['a':'c']

a    0.25
b    0.50
c    0.75
dtype: float64

*When slicing with an implicit index (i.e.,data[0:2, the final index is excluded from the slice.*

In [ ]:
# slicing by implicit integer index
data[0:2]

a    0.25
b    0.50
dtype: float64

*To avoid the potential confusion in explicit and implicit indices, Pandas provides some special indexer attributes that explicitly expose certain indexing schemes.*

In [ ]:
# masking
data[(data > 0.3) & (data < 0.8)]

b    0.50
c    0.75
dtype: float64

In [ ]:
# fancy indexing
data[['a', 'e']]

a    0.25
e    1.25
dtype: float64

To avoid the potential confusion in explicit and implicit indices, Pandas provides some special *indexer* attributes (*loc, iloc*, and *ix*) that explicitly expose certain indexing schemes.

The loc attribute allows indexing and slicing that always references the explicit index, while the iloc attribute allows indexing and slicing that always references the implicit Python-style index. A third indexing attribute, ix, is a hybrid of the two, and for Series objects is equivalent to standard []-based indexing.

In [ ]:
data = pd.Series(['a', 'b', 'c'], index=[1, 3, 5])
data

1    a
3    b
5    c
dtype: object

In [ ]:
# explicit index when indexing
data[1]

'a'

In [ ]:
# implicit index when slicing
data[1:3]

3    b
5    c
dtype: object

In [ ]:
data.loc[1]

'a'

In [ ]:
data.loc[1:3]

1    a
3    b
dtype: object

In [ ]:
data.iloc[1]

'b'

In [ ]:
data.iloc[1:3]

3    b
5    c
dtype: object

# **Data Selection in DataFrame**

**DataFrame as a dictionary**

In [ ]:
area = pd.Series({'California': 423967, 'Texas': 695662,
                  'New York': 141297, 'Florida': 170312,
                  'Illinois': 149995})
pop = pd.Series({'California': 38332521, 'Texas': 26448193,
                  'New York': 19651127, 'Florida': 19552860,
                  'Illinois': 12882135})
data = pd.DataFrame({'area':area, 'pop':pop})
data

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

*The columns of the DataFrame can be accessed via dictionary-style indexing of the column name:*

In [ ]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

*We can use attribute-style access only with column names that are strings:*

In [ ]:
data.area

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

*Adding a new column:*

In [ ]:
data['density'] = data['pop'] / data['area']
data

              area       pop     density
California  423967  38332521   90.413926
Texas       695662  26448193   38.018740
New York    141297  19651127  139.076746
Florida     170312  19552860  114.806121
Illinois    149995  12882135   85.883763

***DataFrame as two-dimensional array***

*Use the values attribute to examine the raw underlying data array*

In [ ]:
data.values

array([[4.23967000e+05, 3.83325210e+07, 9.04139261e+01],
       [6.95662000e+05, 2.64481930e+07, 3.80187404e+01],
       [1.41297000e+05, 1.96511270e+07, 1.39076746e+02],
       [1.70312000e+05, 1.95528600e+07, 1.14806121e+02],
       [1.49995000e+05, 1.28821350e+07, 8.58837628e+01]])

*Can transpose the full DataFrame to swap rows and columns*

In [ ]:
data.T

           California         Texas      New York       Florida      Illinois
area     4.239670e+05  6.956620e+05  1.412970e+05  1.703120e+05  1.499950e+05
pop      3.833252e+07  2.644819e+07  1.965113e+07  1.955286e+07  1.288214e+07
density  9.041393e+01  3.801874e+01  1.390767e+02  1.148061e+02  8.588376e+01

*Passing a single index to an array accesses a row:*

In [ ]:
data.values[0]

array([4.23967000e+05, 3.83325210e+07, 9.04139261e+01])

*Passing a single "index" to a DataFrame accesses a column*

In [ ]:
data['area']

California    423967
Texas         695662
New York      141297
Florida       170312
Illinois      149995
Name: area, dtype: int64

In [ ]:
data.iloc[:3, :2]

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127

In [ ]:
data.loc[:'Illinois', :'pop']

              area       pop
California  423967  38332521
Texas       695662  26448193
New York    141297  19651127
Florida     170312  19552860
Illinois    149995  12882135

In [ ]:
# data.ix[:3, :'pop']
# ix is deprecated i favor of iloc

# **How to read in data**

**Reading data from CSVs**

In [ ]:
url = "https://guoyuanxiong.github.io/images/purchases.csv"
df = pd.read_csv(url)
df

  Unnamed: 0   apples   oranges
0       June        3         0
1     Robert        2         3
2       Lily        0         7
3      David        1         2

*CSVs don't have indexes like our DataFrames, so all we need to do is just designate the **index_col** when reading:*

In [ ]:
url = "https://guoyuanxiong.github.io/images/purchases.csv"
df = pd.read_csv(url, index_col=0)
df

         apples   oranges
June          3         0
Robert        2         3
Lily          0         7
David         1         2

**Reading data from JSON Dataframe**

In [ ]:
JSON = [
  {
    "": 0,
    "Unnamed: O": "June",
    "apples": 3,
    "oranges": 0
  },
  {
    "": 1,
    "Unnamed: O": "Robert",
    "apples": 2,
    "oranges": 3
  },
  {
    "": 2,
    "Unnamed: O": "Lily",
    "apples": 0,
    "oranges": 7
  },
  {
    "": 3,
    "Unnamed: O": "David",
    "apples": 1,
    "oranges": 2
  }
]

df = pd.DataFrame(JSON)

df

     Unnamed: O  apples  oranges
0  0       June       3        0
1  1     Robert       2        3
2  2       Lily       0        7
3  3      David       1        2

**Reading data from a SQL database**

*We could use set_index() on any DataFrame using any column at any time.*

In [ ]:
df = df.set_index('apples')
df

          Unnamed: O  oranges
apples
3       0       June        0
2       1     Robert        3
0       2       Lily        7
1       3      David        2

**Converting back to a CSV and JSON**



*   After extensive work on cleaning your data, youre now ready to save it as a file of your choice.
*   When we save JSON and CSV files, all we have to input into those functions is our desired filename with the appropriate file extension.

In [ ]:
df.to_csv('new_purchases.csv')
df.to_json('new_purchases.json')

# **Important DataFrame Operations**

**Loading Dataset**

In [ ]:
url = "https://docs.google.com/spreadsheets/d/e/2PACX-1vQ_ZqyiCjnAAO_KDx_06sbGmGsd6jQomFJrlnaVydqFBw6KZwL9xZ9Ume3J_MUuU_5DH1IQ85P_9vA6/pub?gid=1309831261&single=true&output=csv"
movies_df= pd.read_csv(url, index_col="Title")

**View your data**

In [ ]:
movies_df.head()
movies_df.tail(2)

              Rank                  Genre  ... Revenue (Millions) Metascore
Title                                      ...
Search Party   999       Adventure,Comedy  ...                NaN      22.0
Nine Lives    1000  Comedy,Family,Fantasy  ...              19.64      11.0

[2 rows x 11 columns]

**Getting info about your data**

In [ ]:
movies_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1000 entries, Guardians of the Galaxy to Nine Lives
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   Rank                1000 non-null   int64
 1   Genre               1000 non-null   object
 2   Description         1000 non-null   object
 3   Director            1000 non-null   object
 4   Actors              1000 non-null   object
 5   Year                1000 non-null   int64
 6   Runtime (Minutes)   1000 non-null   int64
 7   Rating              1000 non-null   float64
 8   Votes               1000 non-null   int64
 9   Revenue (Millions)  872 non-null    float64
 10  Metascore           936 non-null    float64
dtypes: float64(3), int64(4), object(4)
memory usage: 93.8+ KB

In [ ]:
movies_df.shape

(1000, 11)

**Handling duplicates**

*This dataset does not have duplicate rows, but it is always important to verify you aren't aggregating duplicate rows.*

In [ ]:
temp_df= movies_df.append(movies_df)
temp_df.shape

(2000, 11)

In [ ]:
temp_df= temp_df.drop_duplicates()
# OR
temp_df.drop_duplicates(inplace=True)
temp_df.shape

(1000, 11)

Another important argument for drop_duplicates() is keep, which has three possible options:

**first:** (default) Drop duplicates except for the first occurrence

**last:** Drop duplicates except for the last occurrence

**False:** Drop all duplicates

In [ ]:
temp_df= movies_df.append(movies_df) # make a new copy
temp_df.drop_duplicates(inplace=True, keep=False)
temp_df.shape

(0, 11)

**Print the column names of our dataset**

In [ ]:
movies_df.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year',
       'Runtime (Minutes)', 'Rating', 'Votes', 'Revenue (Millions)',
       'Metascore'],
      dtype='object')

**Use .rename() method to rename certain or all columns via a dict.**

In [ ]:
movies_df.rename(columns={
'Runtime (Minutes)': 'Runtime',
'Revenue (Millions)': 'Revenue_millions'
}, inplace=True)
movies_df.columns

Index(['Rank', 'Genre', 'Description', 'Director', 'Actors', 'Year', 'Runtime',
       'Rating', 'Votes', 'Revenue_millions', 'Metascore'],
      dtype='object')

**What if we want to lowercase all names? Instead of
using .rename() we could also set a list of names to the columns like so:**

In [ ]:
movies_df.columns= ['rank', 'genre', 'description', 'director', 'actors', 'year', 'runtime', 'rating', 'votes', 'revenue_millions', 'metascore']
movies_df.columns

Index(['rank', 'genre', 'description', 'director', 'actors', 'year', 'runtime',
       'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

**But that's too much work. Instead of just renaming each column manually we can do a list comprehension:**

In [ ]:
movies_df.columns= [col.lower() for col in movies_df]
movies_df.columns

Index(['rank', 'genre', 'description', 'director', 'actors', 'year', 'runtime',
       'rating', 'votes', 'revenue_millions', 'metascore'],
      dtype='object')

# **Work with Missing Values**

**Check which cells in our DataFrameare null**

In [ ]:
movies_df.isnull()

                          rank  genre  ...  revenue_millions  metascore
Title                                  ...
Guardians of the Galaxy  False  False  ...             False      False
Prometheus               False  False  ...             False      False
Split                    False  False  ...             False      False
Sing                     False  False  ...             False      False
Suicide Squad            False  False  ...             False      False
...                        ...    ...  ...               ...        ...
Secret in Their Eyes     False  False  ...              True      False
Hostel: Part II          False  False  ...             False      False
Step Up 2: The Streets   False  False  ...             False      False
Search Party             False  False  ...              True      False
Nine Lives               False  False  ...             False      False

[1000 rows x 11 columns]

**Count the number of nulls in each column**

In [ ]:
movies_df.isnull().sum()

rank                  0
genre                 0
description           0
director              0
actors                0
year                  0
runtime               0
rating                0
votes                 0
revenue_millions    128
metascore            64
dtype: int64

**Remove null values**

*This operation will delete any row with at least a single null value, but it will return a new DataFrame without altering the original one. You could specify in place=True in this method as well.*

In [ ]:
movies_df.dropna()

                          rank  ... metascore
Title                           ...
Guardians of the Galaxy      1  ...      76.0
Prometheus                   2  ...      65.0
Split                        3  ...      62.0
Sing                         4  ...      59.0
Suicide Squad                5  ...      40.0
...                        ...  ...       ...
Resident Evil: Afterlife   994  ...      37.0
Project X                  995  ...      48.0
Hostel: Part II            997  ...      46.0
Step Up 2: The Streets     998  ...      50.0
Nine Lives                1000  ...      11.0

[838 rows x 11 columns]

*Drop columns with null values*

In [ ]:
movies_df.dropna(axis=1)

                         rank                     genre  ... rating   votes
Title                                                    ...
Guardians of the Galaxy     1   Action,Adventure,Sci-Fi  ...    8.1  757074
Prometheus                  2  Adventure,Mystery,Sci-Fi  ...    7.0  485820
Split                       3           Horror,Thriller  ...    7.3  157606
Sing                        4   Animation,Comedy,Family  ...    7.2   60545
Suicide Squad               5  Action,Adventure,Fantasy  ...    6.2  393727
...                       ...                       ...  ...    ...     ...
Secret in Their Eyes      996       Crime,Drama,Mystery  ...    6.2   27585
Hostel: Part II           997                    Horror  ...    5.5   73152
Step Up 2: The Streets    998       Drama,Music,Romance  ...    6.2   70699
Search Party              999          Adventure,Comedy  ...    5.6    4881
Nine Lives               1000     Comedy,Family,Fantasy  ...    5.3   12435

[1000 rows x 9 columns]

# **Check Data Statistics**

**Understanding your variables**

*Using describe()on an entire DataFramewe can get a summary of the distribution of continuous variables*

In [ ]:
movies_df.describe()

              rank         year  ...  revenue_millions   metascore
count  1000.000000  1000.000000  ...        872.000000  936.000000
mean    500.500000  2012.783000  ...         82.956376   58.985043
std     288.819436     3.205962  ...        103.253540   17.194757
min       1.000000  2006.000000  ...          0.000000   11.000000
25%     250.750000  2010.000000  ...         13.270000   47.000000
50%     500.500000  2014.000000  ...         47.985000   59.500000
75%     750.250000  2016.000000  ...        113.715000   72.000000
max    1000.000000  2016.000000  ...        936.630000  100.000000

[8 rows x 7 columns]

*By using the correlation method.corr() we can generate the relationship between each continuous variable:*

In [ ]:
movies_df.corr()

                      rank      year  ...  revenue_millions  metascore
rank              1.000000 -0.261605  ...         -0.271592  -0.191869
year             -0.261605  1.000000  ...         -0.126790  -0.079305
runtime          -0.221739 -0.164900  ...          0.267953   0.211978
rating           -0.219555 -0.211219  ...          0.217654   0.631897
votes            -0.283876 -0.411904  ...          0.639661   0.325684
revenue_millions -0.271592 -0.126790  ...          1.000000   0.142397
metascore        -0.191869 -0.079305  ...          0.142397   1.000000

[7 rows x 7 columns]

*.describe() can also be used on a categorical variable to get the count of rows, unique count of categories, top category, and freq of top category:*

In [ ]:
movies_df['genre'].describe()

count                        1000
unique                        207
top       Action,Adventure,Sci-Fi
freq                           50
Name: genre, dtype: object

*.value_counts() can tell us the frequency of all values in a column:*

In [ ]:
movies_df['genre'].value_counts().head(10)

Action,Adventure,Sci-Fi       50
Drama                         48
Comedy,Drama,Romance          35
Comedy                        32
Drama,Romance                 31
Action,Adventure,Fantasy      27
Animation,Adventure,Comedy    27
Comedy,Drama                  27
Comedy,Romance                26
Crime,Drama,Thriller          24
Name: genre, dtype: int64

# **DataFrame Slicing, Selecting, and Extracting**

**By columns**

In [ ]:
genre_col= movies_df['genre']
type(genre_col)

pandas.core.series.Series

In [ ]:
genre_col= movies_df[['genre']]
type(genre_col)

pandas.core.frame.DataFrame

In [ ]:
subset = movies_df[['genre', 'rating']]
subset.head()

                                            genre  rating
Title
Guardians of the Galaxy   Action,Adventure,Sci-Fi     8.1
Prometheus               Adventure,Mystery,Sci-Fi     7.0
Split                             Horror,Thriller     7.3
Sing                      Animation,Comedy,Family     7.2
Suicide Squad            Action,Adventure,Fantasy     6.2

**By rows: two options**

*   .loc-locates by name
*   .iloc-locates by numerical index

In [ ]:
# Single Row

prom = movies_df.loc["Prometheus"]
prom = movies_df.iloc[1]              # 1 is the numerical index of Prometheus:

In [ ]:
# Multiple Rows

movie_subset= movies_df.loc['Prometheus':'Sing']
movie_subset= movies_df.iloc[1:4]

**Conditional selections**

*For example, what if we want to filter our movies DataFrame to show only films directed by Ridley Scott or films with a rating greater than or equal to 8.0?*

In [ ]:
condition = (movies_df['director'] == "Ridley Scott")
condition.head()

Title
Guardians of the Galaxy    False
Prometheus                  True
Split                      False
Sing                       False
Suicide Squad              False
Name: director, dtype: bool

*Similar to isnull(), this returns a Series of True and False values: True for films directed by Ridley Scott and False for ones not directed by him.*

In [ ]:
movies_df[movies_df['director'] == "Ridley Scott"]

movies_df[movies_df['rating'] >= 8.6]

movies_df[(movies_df['director'] == 'Christopher Nolan') | (movies_df['director'] == 'Ridley Scott')]

                        rank  ... metascore
Title                         ...
Prometheus                 2  ...      65.0
Interstellar              37  ...      74.0
The Dark Knight           55  ...      82.0
The Prestige              65  ...      66.0
Inception                 81  ...      74.0
The Martian              103  ...      80.0
The Dark Knight Rises    125  ...      78.0
Robin Hood               388  ...      53.0
American Gangster        471  ...      76.0
Exodus: Gods and Kings   517  ...      52.0
The Counselor            522  ...      48.0
A Good Year              531  ...      47.0
Body of Lies             738  ...      57.0

[13 rows x 11 columns]

*Say we want all movies that were released between 2005 and 2010, have a rating above 8.0, but made below the 25th percentile in revenue.*

In [ ]:
movies_df[
((movies_df['year'] >= 2005) & (movies_df['year'] <= 2010))
& (movies_df['rating'] > 8.0)
& (movies_df['revenue_millions'] < movies_df['revenue_millions'].quantile(0.25))
]

                     rank               genre  ... revenue_millions metascore
Title                                          ...
3 Idiots              431        Comedy,Drama  ...             6.52      67.0
The Lives of Others   477      Drama,Thriller  ...            11.28      89.0
Incendies             714   Drama,Mystery,War  ...             6.86      80.0
Taare Zameen Par      992  Drama,Family,Music  ...             1.20      42.0

[4 rows x 11 columns]

# **Apply Functions**

*   For example, we want to convert movies with an 8.0 or greater to a string value of "good" and the rest to "bad" and use this transformed values to create a new column.
*   It is possible to iterate over a DataFrame or Series as you would with a list, but doing so  especially on large datasets is very slow.
*   Using apply() will be much faster than iterating manually over rows because pandas is utilizing vectorization.

*The .apply() method passes every value in the rating column through the rating_function and then returns a new Series. This Series is then assigned
to a new column called rating_category.*

In [ ]:
def rating_function(x):
  if x >= 8.0:
    return "good"
  else:
    return "bad"

movies_df["rating_category"] = movies_df["rating"].apply(rating_function)

*You can also use anonymous functions as well. This lambda function achieves the same result as rating_function:*

In [ ]:
movies_df["rating_category"] = movies_df["rating"].apply(lambda x: 'good' if x >= 8.0 else 'bad')